src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.ПланСчетов</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ПланСчетов.AccountingFlag.Количественный</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

src/ChartsOfAccounts/ПланСчетов/ПланСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>ПланСчетов</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>01</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>02</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

src/Documents/ПриходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.Управленческий.Записывать = Истина;
	Для Каждого Строка Из Товары Цикл
		Запись = Движения.Управленческий.Добавить();
		Запись.Период = Дата;
		Запись.СчетДт = ПланыСчетов.ПланСчетов.Товары;
		Запись.СчетКт = ПланыСчетов.ПланСчетов.Поставщики;
		Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Товары] = Строка.Товар;
		Запись.Сумма = 100;
	КонецЦикла;


КонецПроцедуры

// Описание
// 	Получает какие-то параметры
// Параметры:
// 	Отказ - Строка - Если что-то пошло не так
// Возвращаемое значение:
// 	Структура - описание:
// 		* Дата - Дата - Дата операции
// 		* Товар - СправочникСсылка.Товары - Какой-то товар
// Пример: блаблаблапример
Функция Параметры(Отказ)
	Возврат Новый Структура("Дата, Товар", ТекущаяДата(), Справочники.Товары.ПустаяСсылка());	
КонецФункции
